## Apply on same dataframes

In [1]:
import pandas as pd

df_1 = pd.DataFrame([['ram', 25, 48], ['eswar', 24, 54], ['naveen', 26, 60], ['anand', 26, 60]], columns=['name', 'Age', 'sal'])
df_2 = pd.DataFrame([['ram', 25, 48], ['eswar', 24, 54], ['naveen', 26, 60], ['anand', 26, 60]], columns=['name', 'Age', 'sal'])

In [2]:
from two_datasets_sanity_check import TwoDatasetsSanityCheck

sanity_check = TwoDatasetsSanityCheck(df_1=df_1, df_2=df_2)

True

In [3]:
sanity_check.df_1

     name  age  sal
0     ram   25   48
1   eswar   24   54
2  naveen   26   60
3   anand   26   60

In [4]:
sanity_check.df_2

     name  age  sal
0     ram   25   48
1   eswar   24   54
2  naveen   26   60
3   anand   26   60

In [5]:
sanity_check.column_diff

'Both df_1 and df_2 columns names are same [No difference]'

In [6]:
sanity_check.clms_rows_count_diff

      Rows  Columns
df_1     4        3
df_2     4        3

In [7]:
sanity_check.null_value_diff

  Column Name  df_1 null values  df_2 null values
0         age                 0                 0
1        name                 0                 0
2         sal                 0                 0

In [8]:
sanity_check.rows_missing_in_df_1

'All df_2 rows prasent in df_1'

In [9]:
sanity_check.rows_missing_in_df_2

'All df_1 rows prasent in df_2'

In [10]:
sanity_check.status

'Both data is similar'

In [11]:
sanity_check.values_diff

'No values difference between two datasets'

## Apply On Different Data Sets

In [12]:
import pandas as pd

df_1 = pd.DataFrame([['Suresh', 25, None], ['eswar', 24, 54], ['naveen', 26, 60], ['anand', 26, 60]], columns=['name', 'Age', 'sal'])
df_2 = pd.DataFrame([['ram', 25, 48, 1], ['eswar', 26, 54, 2], ['naveen', 26, 60, 3], ['Sri', 96, 60, 7], \
['anand', 26, 60, 4]], columns=['name', 'Age', 'sal', 'id'])

In [13]:
from two_datasets_sanity_check import TwoDatasetsSanityCheck

sanity_check = TwoDatasetsSanityCheck(df_1=df_1, df_2=df_2)

True

In [14]:
sanity_check.df_1
sanity_check.df_2
sanity_check.column_diff
sanity_check.clms_rows_count_diff
sanity_check.null_value_diff
sanity_check.rows_missing_in_df_1
sanity_check.rows_missing_in_df_2
sanity_check.status
sanity_check.values_diff

'Columns or Rows are not identical'

In [15]:
sanity_check.df_1

     name  age   sal
0  Suresh   25   NaN
1   eswar   24  54.0
2  naveen   26  60.0
3   anand   26  60.0

In [16]:
sanity_check.df_2

     name  age  sal  id
0     ram   25   48   1
1   eswar   26   54   2
2  naveen   26   60   3
3     Sri   96   60   7
4   anand   26   60   4

In [17]:
sanity_check.column_diff

{'df_2_extra_columns': ['id'], 'df_1_extra_columns': []}

In [18]:
sanity_check.clms_rows_count_diff

      Rows  Columns
df_1     4        3
df_2     5        4

In [19]:
sanity_check.null_value_diff

  Column Name  df_1 null values  df_2 null values
0          id  Column not exist                 0
1         age                 0                 0
2        name                 0                 0
3         sal                 1                 0

In [20]:
sanity_check.rows_missing_in_df_1

    name  age  sal
0    ram   25   48
1  eswar   26   54
3    Sri   96   60

In [21]:
sanity_check.rows_missing_in_df_2

     name  age   sal
0  Suresh   25   NaN
1   eswar   24  54.0

In [22]:
sanity_check.status

'Both data not similar'

In [23]:
sanity_check.values_diff

'Columns or Rows are not identical'

### Reverse the above data frames

In [35]:
import pandas as pd

df_2 = pd.DataFrame([['Suresh', 25, None], 
['eswar', 24, 54], 
['naveen', 26, 60], 
['anand', 26, 60]], 
columns=['name', 'Age', 'sal'])
df_1 = pd.DataFrame([['ram', 25, 48, 1], ['eswar', 26, 54, 2], ['naveen', 26, 60, 3], ['Sri', 96, 60, 7], \
['anand', 26, 60, 4]], columns=['name', 'Age', 'sal', 'id'])

In [25]:
from two_datasets_sanity_check import TwoDatasetsSanityCheck

sanity_check = TwoDatasetsSanityCheck(df_1=df_1, df_2=df_2)

True

In [26]:
sanity_check.df_1

     name  age  sal  id
0     ram   25   48   1
1   eswar   26   54   2
2  naveen   26   60   3
3     Sri   96   60   7
4   anand   26   60   4

In [27]:
sanity_check.df_2

     name  age   sal
0  Suresh   25   NaN
1   eswar   24  54.0
2  naveen   26  60.0
3   anand   26  60.0

In [28]:
sanity_check.column_diff

{'df_2_extra_columns': [], 'df_1_extra_columns': ['id']}

In [29]:
sanity_check.clms_rows_count_diff

      Rows  Columns
df_1     5        4
df_2     4        3

In [30]:
sanity_check.null_value_diff

  Column Name  df_1 null values  df_2 null values
0          id                 0  Column not exist
1         age                 0                 0
2        name                 0                 0
3         sal                 0                 1

In [31]:
sanity_check.rows_missing_in_df_1

     name  age   sal
0  Suresh   25   NaN
1   eswar   24  54.0

In [32]:
sanity_check.rows_missing_in_df_2

    name  age  sal
0    ram   25   48
1  eswar   26   54
3    Sri   96   60

In [33]:
sanity_check.status

'Both data not similar'

In [34]:
sanity_check.values_diff

'Columns or Rows are not identical'